docs: redesign github readme
